In [1]:
import pandas as pd

In [2]:
dept = pd.read_csv('C:/_WsHongik20210507/data/deptDB.csv' ,names = ['deptno','dname','loc'],header=None)

In [3]:
sawonDB = pd.read_csv('./data/sawonDB.csv',names = ['sabun','saname','deptno','sajob','sapay','sahire','sasex','samgr'],header=None)

In [4]:
gogek = pd.read_csv("./data/gogekDB.csv",names = ['gobun','goname','gotel','gojumin','godam'],header=None)

In [5]:
dept

   deptno   dname    loc
0      10   '총무부'   '서울'
1      20   '영업부'   '대전'
2      30   '전산부'   '부산'
3      40   '관리부'   '광주'

In [6]:
sawonDB.head(2)

   sabun  saname  deptno  sajob  sapay         sahire  sasex  samgr
0      1   '홍길동'      10   '회장'   5000   '1980/01/01'   '남자'   null
1      2   '한국남'      20   '부장'   3000   '1988/11/01'   '남자'      1

In [7]:
deptSawon = dept.merge(sawonDB, how='inner',on = 'deptno')
deptSawon.head(2)

,deptno,dname,loc,sabun,saname,sajob,sapay,sahire,sasex,samgr
0,10,'총무부','서울',1,'홍길동','회장',5000,'1980/01/01','남자',null
1,10,'총무부','서울',13,'무궁화','부장',3000,'1996/11/01','여자',1

In [8]:
sawonDB['saname'] = sawonDB['saname'].str.strip("' ")
sawonDB['sajob'] = sawonDB['sajob'].str.strip("' ")
sawonDB['sahire'] = sawonDB['sahire'].str.strip("' ")
sawonDB['sasex'] = sawonDB['sasex'].str.strip("' ")

In [ ]:
#문제 10] sawonDB.csv 를 로드하고 이름을 입력받은후 이름을 입력하면 해당 사원의 월급이 출력되게 하시오
a = input("사원의 이름을 입력하세요 : ")
b = sawonDB[sawonDB['saname'].str.contains(a)]